Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.NoRoomBoundingElementsWarn Property
 Can't create any energy analysis surfaces. There are no Room bounding elements defined in the current phase. Please check the Project Information settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRoomBoundingElementsWarn { get; }
Public Shared ReadOnly Property NoRoomBoundingElementsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRoomBoundingElementsWarn {
	FailureDefinitionId^ get ();
}
static member NoRoomBoundingElementsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace